[
  {
    "id": "1",
    "bookName": "The Hate You Give",
    "author": "Angie Thomas",
    "image": "https://i.ibb.co.com/M5rjL6N/3.png",
    "review": "A profound exploration of the impact of colonialism on African societies, told through the life of Okonkwo, a respected Igbo leader. Achebe's portrayal of traditional African culture and the disruptions caused by European colonization is both insightful and tragic. The novel delves into themes of identity, resistance, and the inevitable clash between old customs and new forces.",
    "totalPages": 209,
    "rating": 4.3,
    "category": "Historical Fiction",
    "tags": ["Africa", "Colonialism", "Tragedy"],
    "publisher": "William Heinemann",
    "yearOfPublishing": 2003
  },
  {
    "id": "2",
    "bookName": "Loving Jesus More",
    "author": "Phil Ryken",
    "image": "https://i.ibb.co.com/GxwrNSh/6.png",
    "review": "A collection of magical tales that have become a staple of childhood literature, featuring stories like 'The Little Mermaid' and 'The Ugly Duckling'. Andersen's tales blend fantasy with poignant life lessons, addressing themes of transformation, love, and resilience. These stories continue to resonate across generations, carrying timeless moral lessons and captivating imaginations.",
    "totalPages": 784,
    "rating": 4.5,
    "category": "Fairy Tales",
    "tags": ["Fantasy", "Children", "Morality"],
    "publisher": "C.A. Reitzel",
    "yearOfPublishing": 1996
  },
  {
    "id": "3",
    "bookName": "Art Of Good Conversation",
    "author": "Catherine Blyth",
    "image": "https://i.ibb.co.com/zJK6wJP/7.png",
    "review": "A masterpiece of Western literature, this epic poem follows Dante's journey through Hell, Purgatory, and Paradise. It offers rich imagery and philosophical depth, reflecting on the nature of sin, redemption, and divine justice. Dante's vivid depictions of the afterlife and his theological insights have influenced countless artists and thinkers throughout history.",
    "totalPages": 928,
    "rating": 4.7,
    "category": "Epic Poetry",
    "tags": ["Philosophy", "Religion", "Medieval"],
    "publisher": "Giovanni Boccaccio",
    "yearOfPublishing": 1988
  },
  {
    "id": "4",
    "bookName": "Cold Case Christianity",
    "author": "J. Warner Wallace",
    "image": "https://i.ibb.co.com/m41YZM0/8.png",
    "review": "One of the oldest known works of literature, this epic recounts the adventures of Gilgamesh, a Sumerian king, as he searches for immortality. The story examines themes of friendship, human mortality, and the pursuit of wisdom. Its enduring relevance lies in its exploration of universal human emotions and challenges, making it a foundational text of world literature.",
    "totalPages": 160,
    "rating": 4.2,
    "category": "Epic",
    "tags": ["Mythology", "Ancient History", "Adventure"],
    "publisher": "Unknown",
    "yearOfPublishing": 1999
  },
  {
    "id": "5",
    "bookName": "Why Do You Hate Money",
    "author": "Jerry Mintz",
    "image": "https://i.ibb.co.com/7t1BYds/hate-money.png",
    "review": "A poetic and philosophical text from the Bible, 'The Book of Job' explores the themes of suffering, divine justice, and human endurance. Job's unwavering faith in the face of immense trials offers profound lessons on resilience and spirituality. This timeless work continues to inspire and provoke deep reflection on life's greatest challenges.",
    "totalPages": 176,
    "rating": 4.4,
    "category": "Religious Text",
    "tags": ["Philosophy", "Religion", "Theology"],
    "publisher": "Unknown",
    "yearOfPublishing": 2001
  },
  {
    "id": "6",
    "bookName": "The Dating Playbook for Men",
    "author": "Andrew Ferebee",
    "image": "https://i.ibb.co.com/Qkw6my8/heroBook.png",
    "review": "This enchanting collection of Middle Eastern folktales, told by Scheherazade to save her life, includes timeless stories like 'Aladdin' and 'Ali Baba.' The tales explore themes of magic, adventure, and human ingenuity. Rich in cultural heritage, these stories highlight the power of storytelling and its ability to captivate and educate across generations.",
    "totalPages": 288,
    "rating": 4.6,
    "category": "Folk Tales",
    "tags": ["Fantasy", "Adventure", "Middle Eastern"],
    "publisher": "Unknown",
    "yearOfPublishing": 1995
  },
  {
    "id": "7",
    "bookName": "Scholarship Monthly Planner",
    "author": "Unknown",
    "image": "https://i.ibb.co.com/D9S0SBB/scholarship.png",
    "review": "An Icelandic saga rich with history and legend, focusing on themes of honor, revenge, and the complexities of human relationships. The narrative centers on the lives of Njál and Gunnar and their struggles in a society bound by strict codes of conduct. Its vivid storytelling provides an invaluable glimpse into Viking-era culture and values.",
    "totalPages": 384,
    "rating": 4.1,
    "category": "Saga",
    "tags": ["Historical Fiction", "Norwegian", "Medieval"],
    "publisher": "Unknown",
    "yearOfPublishing": 2010
  },
  {
    "id": "8",
    "bookName": "Spine of Dragon",
    "author": "Kevin J. Anderson",
    "image": "https://i.ibb.co.com/QYzTDZF/Spine-Of-Dragon.png",
    "review": "A timeless romantic comedy that critiques societal norms and explores the dynamics of love and pride. Elizabeth Bennet and Mr. Darcy’s evolving relationship highlights the power of self-awareness and growth in overcoming misunderstandings. Austen’s witty narrative and richly drawn characters make this one of the most beloved novels of all time.",
    "totalPages": 226,
    "rating": 4.8,
    "category": "Romantic Fiction",
    "tags": ["Romance", "Class", "Humor"],
    "publisher": "T. Egerton",
    "yearOfPublishing": 2005
  },
  {
    "id": "9",
    "bookName": "Annotated Texas Family Code",
    "author": "Texas Legal Group",
    "image": "https://i.ibb.co.com/jHcTWh6/texas.png",
    "review": "Set in post-revolutionary France, this novel delves into themes of ambition, social mobility, and family loyalty. Through the story of Père Goriot and his daughters, Balzac paints a vivid portrait of greed and sacrifice. The narrative serves as a poignant critique of the materialism and moral decay of 19th-century society.",
    "totalPages": 443,
    "rating": 4.2,
    "category": "Realist Novel",
    "tags": ["Realism", "Social Commentary", "France"],
    "publisher": "Michel Lévy Frères",
    "yearOfPublishing": 2000
  }
]
